In [9]:
from Fin_Python_Tools import Fin_Python3_PyMySQL

In [10]:
# 实例化 Class 对象。
Fin_PyMySQL = Fin_Python3_PyMySQL.Fin_PyMySQL()

In [11]:
Fin_PyMySQL.Host = "192.168.2.50"
Fin_PyMySQL.User = "goufeng"

In [12]:
df = Fin_PyMySQL.Query(SQL_String="SELECT * FROM sh_000422_20050131_20151231_view;")

In [13]:
df

      _index       _date  _close   SMA5  SMA10   EMA12   EMA26
0          1  2005-01-31    6.81  0.000  0.000  6.8100  6.8100
1          2  2005-02-01    6.42  0.000  0.000  6.7500  6.7811
2          3  2005-02-02    6.90  0.000  0.000  6.7731  6.7899
3          4  2005-02-03    6.75  0.000  0.000  6.7695  6.7869
4          5  2005-02-04    7.00  6.776  0.000  6.8050  6.8027
...      ...         ...     ...    ...    ...     ...     ...
2647    2648  2015-12-25    8.03  7.932  7.775  7.8215  7.7003
2648    2649  2015-12-28    7.71  7.908  7.784  7.8043  7.7010
2649    2650  2015-12-29    7.84  7.898  7.813  7.8098  7.7113
2650    2651  2015-12-30    7.93  7.900  7.851  7.8283  7.7275
2651    2652  2015-12-31    7.77  7.856  7.854  7.8193  7.7306

[2652 rows x 7 columns]